apache/nuttx/arch/arm/src/lpc17xx/lpc17_sdcard.c
/* Initialization/setup */

static void lpc17_reset(FAR struct sdio_dev_s *dev);
static sdio_capset_t lpc17_capabilities(FAR struct sdio_dev_s *dev);
static uint8_t lpc17_status(FAR struct sdio_dev_s *dev);
static void lpc17_widebus(FAR struct sdio_dev_s *dev, bool enable);
static void lpc17_clock(FAR struct sdio_dev_s *dev,
              enum sdio_clock_e rate);
static int  lpc17_attach(FAR struct sdio_dev_s *dev);

/* Command/Status/Data Transfer */

static int  lpc17_sendcmd(FAR struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t arg);
static int  lpc17_recvsetup(FAR struct sdio_dev_s *dev, FAR uint8_t *buffer,
              size_t nbytes);
static int  lpc17_sendsetup(FAR struct sdio_dev_s *dev,
              FAR const uint8_t *buffer, uint32_t nbytes);
static int  lpc17_cancel(FAR struct sdio_dev_s *dev);

static int  lpc17_waitresponse(FAR struct sdio_dev_s *dev, uint32_t cmd);
static int  lpc17_recvshortcrc(FAR struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t *rshort);
static int  lpc17_recvlong(FAR struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t rlong[4]);
static int  lpc17_recvshort(FAR struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t *rshort);
static int  lpc17_recvnotimpl(FAR struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t *rnotimpl);

/* EVENT handler */

static void lpc17_waitenable(FAR struct sdio_dev_s *dev,
              sdio_eventset_t eventset);
static sdio_eventset_t
            lpc17_eventwait(FAR struct sdio_dev_s *dev, uint32_t timeout);
static void lpc17_callbackenable(FAR struct sdio_dev_s *dev,
              sdio_eventset_t eventset);
static int  lpc17_registercallback(FAR struct sdio_dev_s *dev,
              worker_t callback, void *arg);

/* DMA */

#ifdef CONFIG_LPC17_SDCARD_DMA
static int  lpc17_dmarecvsetup(FAR struct sdio_dev_s *dev,
              FAR uint8_t *buffer, size_t buflen);
static int  lpc17_dmasendsetup(FAR struct sdio_dev_s *dev,
              FAR const uint8_t *buffer, size_t buflen);
#endif

/* Initialization/uninitialization/reset ************************************/

static void lpc17_callback(void *arg);
static void lpc17_default(void);

/****************************************************************************
 * Private Data
 ****************************************************************************/

struct lpc17_dev_s g_scard_dev =
{
  .dev =
  {
#ifdef CONFIG_SDIO_MUXBUS
    .lock             = lpc17_lock,
#endif
    .reset            = lpc17_reset,
    .capabilities     = lpc17_capabilities,
    .status           = lpc17_status,
    .widebus          = lpc17_widebus,
    .clock            = lpc17_clock,
    .attach           = lpc17_attach,
    .sendcmd          = lpc17_sendcmd,
    .recvsetup        = lpc17_recvsetup,
    .sendsetup        = lpc17_sendsetup,
    .cancel           = lpc17_cancel,
    .waitresponse     = lpc17_waitresponse,
    .recvR1           = lpc17_recvshortcrc,
    .recvR2           = lpc17_recvlong,
    .recvR3           = lpc17_recvshort,
    .recvR4           = lpc17_recvnotimpl,
    .recvR5           = lpc17_recvnotimpl,
    .recvR6           = lpc17_recvshortcrc,
    .recvR7           = lpc17_recvshort,
    .waitenable       = lpc17_waitenable,
    .eventwait        = lpc17_eventwait,
    .callbackenable   = lpc17_callbackenable,
    .registercallback = lpc17_registercallback,
#ifdef CONFIG_SDIO_DMA
#ifdef CONFIG_LPC17_SDCARD_DMA
    .dmarecvsetup     = lpc17_dmarecvsetup,
    .dmasendsetup     = lpc17_dmasendsetup,
#else
    .dmarecvsetup     = lpc17_recvsetup,
    .dmasendsetup     = lpc17_sendsetup,
#endif
#endif
  },
};

/* Register logging support */

#ifdef CONFIG_DEBUG_MEMCARD_INFO
static struct lpc17_sampleregs_s g_sampleregs[DEBUG_NSAMPLES];
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Low-level Helpers
 ****************************************************************************/
/****************************************************************************
 * Name: lpc17_takesem
 *
 * Description:
 *   Take the wait semaphore (handling false alarm wakeups due to the receipt
 *   of signals).
 *
 * Input Parameters:
 *   dev - Instance of the SD card device driver state structure.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lpc17_takesem(struct lpc17_dev_s *priv)
{
  /* Take the semaphore (perhaps waiting) */

  while (sem_wait(&priv->waitsem) != 0)
    {
      /* The only case that an error should occr here is if the wait was
       * awakened by a signal.
       */

      ASSERT(errno == EINTR);
    }
}

/****************************************************************************
 * Name: lpc17_setclock
 *
 * Description:
 *   Modify oft-changed bits in the CLKCR register.  Only the following bit-
 *   fields are changed:
 *
 *   CLKDIV, PWRSAV, BYPASS, and WIDBUS
 *
 * Input Parameters:
 *   clkcr - A new CLKCR setting for the above mentions bits (other bits
 *           are ignored.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void lpc17_setclock(uint32_t clkcr)
{
  uint32_t regval = getreg32(LPC17_SDCARD_CLOCK);

  /* Clear CLKDIV, PWRSAV, BYPASS, and WIDBUS bits */

  regval &= ~(SDCARD_CLOCK_CLKDIV_MASK | SDCARD_CLOCK_PWRSAV |
              SDCARD_CLOCK_BYPASS | SDCARD_CLOCK_WIDBUS |
              SDCARD_CLOCK_CLKEN);

  /* Replace with user provided settings */

  clkcr  &=  (SDCARD_CLOCK_CLKDIV_MASK | SDCARD_CLOCK_PWRSAV |
              SDCARD_CLOCK_BYPASS | SDCARD_CLOCK_WIDBUS |
              SDCARD_CLOCK_CLKEN);

  regval |=  clkcr;
  putreg32(regval, LPC17_SDCARD_CLOCK);

  mcinfo("CLKCR: %08x PWR: %08x\n",
         getreg32(LPC17_SDCARD_CLOCK), getreg32(LPC17_SDCARD_PWR));
}

/****************************************************************************
 * Name: lpc17_configwaitints
 *
 * Description:
 *   Enable/disable SD card interrupts needed to suport the wait function
 *
 * Input Parameters:
 *   priv       - A reference to the SD card device state structure
 *   waitmask   - The set of bits in the SD card MASK register to set
 *   waitevents - Waited for events
 *   wkupevent  - Wake-up events
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lpc17_configwaitints(struct lpc17_dev_s *priv, uint32_t waitmask,
                                 sdio_eventset_t waitevents,
                                 sdio_eventset_t wkupevent)
{
  irqstate_t flags;

  /* Save all of the data and set the new interrupt mask in one, atomic
   * operation.
   */

  flags = enter_critical_section();
  priv->waitevents = waitevents;
  priv->wkupevent  = wkupevent;
  priv->waitmask   = waitmask;
#ifdef CONFIG_LPC17_SDCARD_DMA
  priv->xfrflags   = 0;
#endif
  putreg32(priv->xfrmask | priv->waitmask, LPC17_SDCARD_MASK0);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: lpc17_configxfrints
 *
 * Description:
 *   Enable SD card interrupts needed to support the data transfer event
 *
 * Input Parameters:
 *   priv    - A reference to the SD card device state structure
 *   xfrmask - The set of bits in the SD card MASK register to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

