apache/nuttx/arch/arm/src/lpc17xx/lpc17_sdcard.c
static void lpc17_configxfrints(struct lpc17_dev_s *priv, uint32_t xfrmask)
{
  irqstate_t flags;
  flags = enter_critical_section();
  priv->xfrmask = xfrmask;
  putreg32(priv->xfrmask | priv->waitmask, LPC17_SDCARD_MASK0);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: lpc17_setpwrctrl
 *
 * Description:
 *   Change the PWRCTRL field of the SD card POWER register to turn the SD card
 *   ON or OFF
 *
 * Input Parameters:
 *   clkcr - A new PWRCTRL setting
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lpc17_setpwrctrl(uint32_t pwrctrl)
{
  uint32_t regval;

  /* Set the new value of the PWRCTRL field of the PWR register.  Also, as a
   * side-effect, clear the OPENDRAIN and ROD bits as well.
   */

  regval  = getreg32(LPC17_SDCARD_PWR);
  regval &= ~(SDCARD_PWR_CTRL_MASK | SDCARD_PWR_OPENDRAIN | SDCARD_PWR_ROD);
  regval |= pwrctrl;
  putreg32(regval, LPC17_SDCARD_PWR);
}

/****************************************************************************
 * Name: lpc17_getpwrctrl
 *
 * Description:
 *   Return the current value of the  the PWRCTRL field of the SD card P
 *   register.  This function can be used to see if the SD card is powered ON
 *   or OFF
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The current value of the  the PWRCTRL field of the SD card PWR register.
 *
 ****************************************************************************/

static inline uint32_t lpc17_getpwrctrl(void)
{
  /* Extract and return the PWRCTRL field of the PWR register. */

  return getreg32(LPC17_SDCARD_PWR) & SDCARD_PWR_CTRL_MASK;
}

/****************************************************************************
 * DMA Helpers
 ****************************************************************************/

/****************************************************************************
 * Name: lpc17_sampleinit
 *
 * Description:
 *   Setup prior to collecting DMA samples
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_MEMCARD_INFO
static void lpc17_sampleinit(void)
{
  memset(g_sampleregs, 0xff, DEBUG_NSAMPLES * sizeof(struct lpc17_sampleregs_s));
}
#endif

/****************************************************************************
 * Name: lpc17_sdcard_sample
 *
 * Description:
 *   Sample SD card registers
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_MEMCARD_INFO
static void lpc17_sdcard_sample(struct lpc17_sdcard_regs_s *regs)
{
  regs->pwr     = (uint8_t)getreg32(LPC17_SDCARD_PWR);
  regs->clkcr   = (uint16_t)getreg32(LPC17_SDCARD_CLOCK);
  regs->dctrl   = (uint16_t)getreg32(LPC17_SDCARD_DCTRL);
  regs->dtimer  = getreg32(LPC17_SDCARD_DTIMER);
  regs->dlen    = getreg32(LPC17_SDCARD_DLEN);
  regs->dcount  = getreg32(LPC17_SDCARD_DCOUNT);
  regs->sta     = getreg32(LPC17_SDCARD_STATUS);
  regs->mask    = getreg32(LPC17_SDCARD_MASK0);
  regs->fifocnt = getreg32(LPC17_SDCARD_FIFOCNT);
}
#endif

/****************************************************************************
 * Name: lpc17_sample
 *
 * Description:
 *   Sample SD card/DMA registers
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_MEMCARD_INFO
static void lpc17_sample(struct lpc17_dev_s *priv, int index)
{
  struct lpc17_sampleregs_s *regs = &g_sampleregs[index];
#if defined(CONFIG_DEBUG_DMA) && defined(CONFIG_LPC17_SDCARD_DMA)
  if (priv->dmamode)
    {
      lpc17_dmasample(priv->dma, &regs->dma);
    }
#endif

  lpc17_sdcard_sample(&regs->sdcard);
}
#endif

/****************************************************************************
 * Name: lpc17_sdcard_dump
 *
 * Description:
 *   Dump one register sample
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_MEMCARD_INFO
static void lpc17_sdcard_dump(struct lpc17_sdcard_regs_s *regs, const char *msg)
{
  mcinfo("SD Card Registers: %s\n", msg);
  mcinfo("  POWER[%08x]: %08x\n", LPC17_SDCARD_PWR,     regs->pwr);
  mcinfo("  CLKCR[%08x]: %08x\n", LPC17_SDCARD_CLOCK,   regs->clkcr);
  mcinfo("  DCTRL[%08x]: %08x\n", LPC17_SDCARD_DCTRL,   regs->dctrl);
  mcinfo(" DTIMER[%08x]: %08x\n", LPC17_SDCARD_DTIMER,  regs->dtimer);
  mcinfo("   DLEN[%08x]: %08x\n", LPC17_SDCARD_DLEN,    regs->dlen);
  mcinfo(" DCOUNT[%08x]: %08x\n", LPC17_SDCARD_DCOUNT,  regs->dcount);
  mcinfo("    STA[%08x]: %08x\n", LPC17_SDCARD_STATUS,  regs->sta);
  mcinfo("   MASK[%08x]: %08x\n", LPC17_SDCARD_MASK0,   regs->mask);
  mcinfo("FIFOCNT[%08x]: %08x\n", LPC17_SDCARD_FIFOCNT, regs->fifocnt);
}
#endif

/****************************************************************************
 * Name: lpc17_dumpsample
 *
 * Description:
 *   Dump one register sample
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_MEMCARD_INFO
static void lpc17_dumpsample(struct lpc17_dev_s *priv,
                             struct lpc17_sampleregs_s *regs, const char *msg)
{
#if defined(CONFIG_DEBUG_DMA) && defined(CONFIG_LPC17_SDCARD_DMA)
  if (priv->dmamode)
    {
      lpc17_dmadump(priv->dma, &regs->dma, msg);
    }
#endif
  lpc17_sdcard_dump(&regs->sdcard, msg);
}
#endif

/****************************************************************************
 * Name: lpc17_dumpsamples
 *
 * Description:
 *   Dump all sampled register data
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_MEMCARD_INFO
static void lpc17_dumpsamples(struct lpc17_dev_s *priv)
{
  lpc17_dumpsample(priv, &g_sampleregs[SAMPLENDX_BEFORE_SETUP], "Before setup");
#if defined(CONFIG_DEBUG_DMA) && defined(CONFIG_LPC17_SDCARD_DMA)
  if (priv->dmamode)
    {
      lpc17_dumpsample(priv, &g_sampleregs[SAMPLENDX_BEFORE_ENABLE], "Before DMA enable");
    }
#endif
  lpc17_dumpsample(priv, &g_sampleregs[SAMPLENDX_AFTER_SETUP], "After setup");
  lpc17_dumpsample(priv, &g_sampleregs[SAMPLENDX_END_TRANSFER], "End of transfer");
#if defined(CONFIG_DEBUG_DMA) && defined(CONFIG_LPC17_SDCARD_DMA)
  if (priv->dmamode)
    {
      lpc17_dumpsample(priv, &g_sampleregs[SAMPLENDX_DMA_CALLBACK], "DMA Callback");
    }
#endif
}
#endif

/****************************************************************************
 * Name: lpc17_dmacallback
 *
 * Description:
 *   Called when SD card DMA completes
 *
 ****************************************************************************/

#ifdef CONFIG_LPC17_SDCARD_DMA
static void lpc17_dmacallback(DMA_HANDLE handle, void *arg, int status)
{
  FAR struct lpc17_dev_s *priv = (FAR struct lpc17_dev_s *)arg;
  DEBUGASSERT(priv->dmamode);
  sdio_eventset_t result;

  /* In the normal case, SD card appears to handle the End-Of-Transfer interrupt
   * first with the End-Of-DMA event occurring significantly later.  On
   * transfer errors, however, the DMA error will occur before the End-of-
   * Transfer.
   */

  lpc17_sample((struct lpc17_dev_s *)arg, SAMPLENDX_DMA_CALLBACK);

  /* Get the result of the DMA transfer */

  if (status < 0)
    {
      dmaerr("ERROR: DMA error %d, remaining: %d\n", status, priv->remaining);
      result = SDIOWAIT_ERROR;
    }
  else
    {
      result = SDIOWAIT_TRANSFERDONE;
    }

  /* Then terminate the transfer if this completes all of the steps in the
   * transfer OR if a DMA error occurred.  In the non-error case, we should
   * already have the SD card transfer done interrupt.  If not, the transfer
   * will appropriately time out.
   */

