apache/nuttx/arch/arm/src/lpc17xx/lpc17_sdcard.c
  mcinfo("eventset: %02x\n", eventset);
  DEBUGASSERT(priv != NULL);

  priv->cbevents = eventset;
  lpc17_callback(priv);
}

/****************************************************************************
 * Name: lpc17_registercallback
 *
 * Description:
 *   Register a callback that that will be invoked on any media status
 *   change.  Callbacks should not be made from interrupt handlers, rather
 *   interrupt level events should be handled by calling back on the work
 *   thread.
 *
 *   When this method is called, all callbacks should be disabled until they
 *   are enabled via a call to SDCARD_CALLBACKENABLE
 *
 * Input Parameters:
 *   dev -      Device-specific state data
 *   callback - The funtion to call on the media change
 *   arg -      A caller provided value to return with the callback
 *
 * Returned Value:
 *   0 on success; negated errno on failure.
 *
 ****************************************************************************/

static int lpc17_registercallback(FAR struct sdio_dev_s *dev,
                                  worker_t callback, void *arg)
{
  struct lpc17_dev_s *priv = (struct lpc17_dev_s *)dev;

  /* Disable callbacks and register this callback and is argument */

  mcinfo("Register %p(%p)\n", callback, arg);
  DEBUGASSERT(priv != NULL);

  priv->cbevents = 0;
  priv->cbarg    = arg;
  priv->callback = callback;
  return OK;
}

/****************************************************************************
 * Name: lpc17_dmarecvsetup
 *
 * Description:
 *   Setup to perform a read DMA.  If the processor supports a data cache,
 *   then this method will also make sure that the contents of the DMA memory
 *   and the data cache are coherent.  For read transfers this may mean
 *   invalidating the data cache.
 *
 * Input Parameters:
 *   dev    - An instance of the SD card device interface
 *   buffer - The memory to DMA from
 *   buflen - The size of the DMA transfer in bytes
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_LPC17_SDCARD_DMA
static int lpc17_dmarecvsetup(FAR struct sdio_dev_s *dev, FAR uint8_t *buffer,
                              size_t buflen)
{
  struct lpc17_dev_s *priv = (struct lpc17_dev_s *)dev;
  uint32_t dblocksize;
  uint32_t regval;
  int ret = -EINVAL;

  DEBUGASSERT(priv != NULL && buffer != NULL && buflen > 0);
  DEBUGASSERT(((uint32_t)buffer & 3) == 0);

  /* Reset the DPSM configuration */

  lpc17_datadisable();

  /* Wide bus operation is required for DMA */

  if (priv->widebus)
    {
      lpc17_sampleinit();
      lpc17_sample(priv, SAMPLENDX_BEFORE_SETUP);

      /* Save the destination buffer information for use by the interrupt handler */

      priv->buffer    = (uint32_t *)buffer;
      priv->remaining = buflen;
      priv->dmamode   = true;

      /* Then set up the SD card data path */

      dblocksize = lpc17_log2(buflen) << SDCARD_DCTRL_DBLOCKSIZE_SHIFT;
      lpc17_dataconfig(SDCARD_DTIMER_DATATIMEOUT, buflen,
                       dblocksize | SDCARD_DCTRL_DTDIR);

      /* Configure the RX DMA */

      lpc17_configxfrints(priv, SDCARD_DMARECV_MASK);

      regval  = getreg32(LPC17_SDCARD_DCTRL);
      regval |= SDCARD_DCTRL_DMAEN;
      putreg32(regval, LPC17_SDCARD_DCTRL);

      ret = lpc17_dmasetup(priv->dma, SDCARD_RXDMA32_CONTROL,
                           SDCARD_RXDMA32_CONFIG, LPC17_SDCARD_FIFO,
                           (uint32_t)buffer, (buflen + 3) >> 2);
      if (ret == OK)
        {
          /* Start the DMA */

          lpc17_sample(priv, SAMPLENDX_BEFORE_ENABLE);
          lpc17_dmastart(priv->dma, lpc17_dmacallback, priv);
          lpc17_sample(priv, SAMPLENDX_AFTER_SETUP);
        }
    }

  return ret;
}
#endif

/****************************************************************************
 * Name: lpc17_dmasendsetup
 *
 * Description:
 *   Setup to perform a write DMA.  If the processor supports a data cache,
 *   then this method will also make sure that the contents of the DMA memory
 *   and the data cache are coherent.  For write transfers, this may mean
 *   flushing the data cache.
 *
 * Input Parameters:
 *   dev    - An instance of the SD card device interface
 *   buffer - The memory to DMA into
 *   buflen - The size of the DMA transfer in bytes
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_LPC17_SDCARD_DMA
static int lpc17_dmasendsetup(FAR struct sdio_dev_s *dev,
                              FAR const uint8_t *buffer, size_t buflen)
{
  struct lpc17_dev_s *priv = (struct lpc17_dev_s *)dev;
  uint32_t dblocksize;
  uint32_t regval;
  int ret = -EINVAL;

  DEBUGASSERT(priv != NULL && buffer != NULL && buflen > 0);
  DEBUGASSERT(((uint32_t)buffer & 3) == 0);

  /* Reset the DPSM configuration */

  lpc17_datadisable();

  /* Wide bus operation is required for DMA */

  if (priv->widebus)
    {
      lpc17_sampleinit();
      lpc17_sample(priv, SAMPLENDX_BEFORE_SETUP);

      /* Save the source buffer information for use by the interrupt handler */

      priv->buffer    = (uint32_t *)buffer;
      priv->remaining = buflen;
      priv->dmamode   = true;

      /* Then set up the SD card data path */

      dblocksize = lpc17_log2(buflen) << SDCARD_DCTRL_DBLOCKSIZE_SHIFT;
      lpc17_dataconfig(SDCARD_DTIMER_DATATIMEOUT, buflen, dblocksize);

      /* Configure the TX DMA */

      ret = lpc17_dmasetup(priv->dma, SDCARD_TXDMA32_CONTROL,
                           SDCARD_TXDMA32_CONFIG, (uint32_t)buffer,
                           LPC17_SDCARD_FIFO, (buflen + 3) >> 2);
      if (ret == OK)
        {
          lpc17_sample(priv, SAMPLENDX_BEFORE_ENABLE);

          regval  = getreg32(LPC17_SDCARD_DCTRL);
          regval |= SDCARD_DCTRL_DMAEN;
          putreg32(regval, LPC17_SDCARD_DCTRL);

          /* Start the DMA */

          lpc17_dmastart(priv->dma, lpc17_dmacallback, priv);
          lpc17_sample(priv, SAMPLENDX_AFTER_SETUP);

          /* Enable TX interrupts */

