apache/nuttx/arch/arm/src/lpc17xx/lpc17_sdcard.c
          lpc17_configxfrints(priv, SDCARD_DMASEND_MASK);
        }
    }

  return ret;
}
#endif

/****************************************************************************
 * Initialization/uninitialization/reset
 ****************************************************************************/
/****************************************************************************
 * Name: lpc17_callback
 *
 * Description:
 *   Perform callback.
 *
 * Assumptions:
 *   This function does not execute in the context of an interrupt handler.
 *   It may be invoked on any user thread or scheduled on the work thread
 *   from an interrupt handler.
 *
 ****************************************************************************/

static void lpc17_callback(void *arg)
{
  struct lpc17_dev_s *priv = (struct lpc17_dev_s *)arg;

  /* Is a callback registered? */

  DEBUGASSERT(priv != NULL);
  mcinfo("Callback %p(%p) cbevents: %02x cdstatus: %02x\n",
         priv->callback, priv->cbarg, priv->cbevents, priv->cdstatus);

  if (priv->callback)
    {
      /* Yes.. Check for enabled callback events */

      if ((priv->cdstatus & SDIO_STATUS_PRESENT) != 0)
        {
          /* Media is present.  Is the media inserted event enabled? */

          if ((priv->cbevents & SDIOMEDIA_INSERTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }
      else
        {
          /* Media is not present.  Is the media eject event enabled? */

          if ((priv->cbevents & SDIOMEDIA_EJECTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }

      /* Perform the callback, disabling further callbacks.  Of course, the
       * the callback can (and probably should) re-enable callbacks.
       */

      priv->cbevents = 0;

      /* Callbacks cannot be performed in the context of an interrupt handler.
       * If we are in an interrupt handler, then queue the callback to be
       * performed later on the work thread.
       */

      if (up_interrupt_context())
        {
          /* Yes.. queue it */

           mcinfo("Queuing callback to %p(%p)\n", priv->callback, priv->cbarg);
          (void)work_queue(HPWORK, &priv->cbwork, (worker_t)priv->callback, priv->cbarg, 0);
        }
      else
        {
          /* No.. then just call the callback here */

          mcinfo("Callback to %p(%p)\n", priv->callback, priv->cbarg);
          priv->callback(priv->cbarg);
        }
    }
}

/****************************************************************************
 * Name: lpc17_default
 *
 * Description:
 *   Restore SD card registers to their default, reset values
 *
 ****************************************************************************/

static void lpc17_default(void)
{
  putreg32(SDCARD_PWR_RESET,    LPC17_SDCARD_PWR);
  putreg32(SDCARD_CLOCK_RESET,  LPC17_SDCARD_CLOCK);
  putreg32(SDCARD_ARG_RESET,    LPC17_SDCARD_ARG);
  putreg32(SDCARD_CMD_RESET,    LPC17_SDCARD_CMD);
  putreg32(SDCARD_DTIMER_RESET, LPC17_SDCARD_DTIMER);
  putreg32(SDCARD_DLEN_RESET,   LPC17_SDCARD_DLEN);
  putreg32(SDCARD_DCTRL_RESET,  LPC17_SDCARD_DCTRL);
  putreg32(SDCARD_CLEAR_RESET,  LPC17_SDCARD_CLEAR);
  putreg32(SDCARD_MASK0_RESET,  LPC17_SDCARD_MASK0);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: sdio_initialize
 *
 * Description:
 *   Initialize SD card for operation.
 *
 * Input Parameters:
 *   slotno - Not used.
 *
 * Returned Values:
 *   A reference to an SD card interface structure.  NULL is returned on failures.
 *
 ****************************************************************************/

FAR struct sdio_dev_s *sdio_initialize(int slotno)
{
  uint32_t   regval;

  /* There is only one slot */

  struct lpc17_dev_s *priv = &g_scard_dev;

  /* Enable power on SD Interface */

  regval  = getreg32(LPC17_SYSCON_PCONP);
  regval |= SYSCON_PCONP_PCSDC;
  putreg32(regval, LPC17_SYSCON_PCONP);

  /* Initialize the SD card slot structure */
  /* Initialize semaphores */

  nxsem_init(&priv->waitsem, 0, 0);

  /* The waitsem semaphore is used for signaling and, hence, should not have
   * priority inheritance enabled.
   */

  nxsem_setprotocol(&priv->waitsem, SEM_PRIO_NONE);

  /* Create a watchdog timer */

  priv->waitwdog = wd_create();
  DEBUGASSERT(priv->waitwdog);

#ifdef CONFIG_LPC17_SDCARD_DMA
  /* Configure the SDCARD DMA request */

  lpc17_dmaconfigure(DMA_REQ_SDCARD, DMA_DMASEL_SDCARD);

  /* Allocate a DMA channel for SDCARD DMA */

  priv->dma = lpc17_dmachannel();
  DEBUGASSERT(priv->dma);
#endif

  /* Configure GPIOs for 4-bit, wide-bus operation.
   *
   * If bus is multiplexed then there is a custom bus configuration utility
   * in the scope of the board support package.
   */

#ifndef CONFIG_SDIO_MUXBUS
  lpc17_configgpio(GPIO_SD_DAT0);
#ifndef CONFIG_LPC17_SDCARD_WIDTH_D1_ONLY
  lpc17_configgpio(GPIO_SD_DAT1);
  lpc17_configgpio(GPIO_SD_DAT2);
  lpc17_configgpio(GPIO_SD_DAT3);
#endif
  lpc17_configgpio(GPIO_SD_CLK);
  lpc17_configgpio(GPIO_SD_CMD);
#endif

  /* Reset the card and assure that it is in the initial, unconfigured
   * state.
   */

  lpc17_reset(&priv->dev);

  return &g_scard_dev.dev;
}

/****************************************************************************
 * Name: sdio_mediachange
 *
 * Description:
 *   Called by board-specific logic -- posssible from an interrupt handler --
 *   in order to signal to the driver that a card has been inserted or
 *   removed from the slot
 *
 * Input Parameters:
 *   dev        - An instance of the SD card driver device state structure.
 *   cardinslot - true is a card has been detected in the slot; false if a
 *                card has been removed from the slot.  Only transitions
 *                (inserted->removed or removed->inserted should be reported)
 *
 * Returned Values:
 *   None
 *
 ****************************************************************************/

